<html>

<head>
    <meta charset="utf-8" />
<meta name="description" content="" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>
    杨镇涛的一亩三分地
</title>
<link rel="shortcut icon" href="https://imyzt.top/favicon.ico?v=1722764497330">
<!-- <link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css" integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous"> -->
<link href="https://cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.10.0/katex.min.css">
<link rel="stylesheet" href="https://imyzt.top/styles/main.css">
<!-- js -->
<script src="https://cdn.bootcss.com/jquery/3.4.1/jquery.min.js"></script>
<script src="https://imyzt.top/media/js/jquery.sticky-sidebar.min.js"></script>
<script src="https://cdn.bootcss.com/highlight.js/9.12.0/highlight.min.js"></script>
<script src="https://cdn.bootcss.com/moment.js/2.23.0/moment.min.js"></script>


<script type="text/javascript">
    (function(c,l,a,r,i,t,y){
        c[a]=c[a]||function(){(c[a].q=c[a].q||[]).push(arguments)};
        t=l.createElement(r);t.async=1;t.src="https://www.clarity.ms/tag/"+i;
        y=l.getElementsByTagName(r)[0];y.parentNode.insertBefore(t,y);
    })(window, document, "clarity", "script", "ju8elxnz96");
</script>
<script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "https://hm.baidu.com/hm.js?86334929d26be993164458e308aa55ba";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script>


</head>

<body>
    <div class="main">
        <div class="header">
    <div class="nav">
        <div class="logo">
            <a href="https://imyzt.top">
                <img class="avatar" src="https://imyzt.top/images/avatar.png?v=1722764497330" alt="">
            </a>
            <div class="site-title">
                <h1>
                    杨镇涛的一亩三分地
                </h1>
            </div>
        </div>
        <span class="menu-btn fa fa-align-justify"></span>
        <div class="menu-container">
            <ul>
                
                    
                            <li>
                                <a href="/" class="menu">
                                    首页
                                </a>
                            </li>
                            
                                
                    
                            <li>
                                <a href="/archives" class="menu">
                                    归档
                                </a>
                            </li>
                            
                                
                    
                            <li>
                                <a href="/tags" class="menu">
                                    标签
                                </a>
                            </li>
                            
                                
                    
                            <li>
                                <a href="/post/about" class="menu">
                                    关于
                                </a>
                            </li>
                            
                                
            </ul>
        </div>
    </div>
</div>

<script>
    $(document).ready(function() {
        $(".menu-btn").click(function() {
            $(".menu-container").slideToggle();
        });
        $(window).resize(function() {

            if (window.matchMedia('(min-width: 960px)').matches) {
                $(".menu-container").css('display', 'block')
            } else {
                $(".menu-container").css('display', 'none')
            }

        });
    });
</script>

            <div id="main-content" class="post-container main-container">
                <div id="content" class="main-container-left">
                    
        
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/fei-jing-tai-nei-bu-lei-chi-you-wai-bu-lei-de-yin-yong/">
                        非静态内部类持有外部类的引用
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-05-13</time>
                    
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            在分析内存泄漏领域的问题时，时常会提到的就是非静态内部类持有外部类的引用导致的内存泄漏，因为内部类持有了外部类的引用，导致垃圾回收器无法回收外部类对象，久而久之就会存在内存泄漏的隐患。
我们在使用非静态内部类的时候，并不是说我们不手动编码引用外部类对象属性就不存在引用关系，实际上这层关系是通过隐式引用来实现的。
静态内部类持有外部类的引用
我们写一个非静态内部类对象示例：
/**
 * @author imyzt
 * @date 2024/05/13
 * @description 非静态内部类,匿名持有外部类的引用
 */
public class NonStaticInnerClazz {
    private final String name;
    public NonStaticInnerClazz(String name) {
        this.name = name;
    }
    public class Inner {
        public void print() {
            System.out.println(name);
        }
    }
}

可以看到javac之后的代码中，第九行方法形参将外部类NonStaticInnerClazz传入给了内部类的this.this$0属性进行引用。

非静态内部类无法引用外部类的属性
而非静态内部类则没有这种情况。
/**
 * @author imyzt
 * @date 2024/05/13
 * @description 静态内部类,无法引用外部类的属性
 */
public class StaticInnerClazz {
    private final String name;
    public StaticInnerClazz(String name) {
        this.name = name;
    }
    public static class Inner2 {
        public void print2() {
            // Non-static field &#39;name&#39; cannot be referenced from a static context
            // System.out.println(name);
        }
    }
}


其他非静态内部类引用的情况
而其他非静态内部类的情况也有类似的问题：
编写测试类：
/**
 * @author imyzt
 * @date 2024/05/13
 * @description 描述信息
 */
public class NonStaticFieldClazz {
    // 成员变量-匿名内部类的非static实例
    private Inner3 inner3_1 = new Inner3() {
        private Integer field_111;
    };
    // 成员变量-非静态内部类的非static实例
    private Inner3 inner3_2 = new Inner3();
    public void print() {
        // 局部变量-匿名内部类的非static实例
        Inner3 inner3_3 = new Inner3() {
            private Integer field_333;
        };
        // 局部变量-非静态内部类的非static实例
        Inner3 inner3_4 = new Inner3();
    }
    public class Inner3 {
    }
}

1. 成员变量-匿名内部类的非static实例
class NonStaticFieldClazz$1 extends NonStaticFieldClazz.Inner3 {
    private Integer field_111;
    NonStaticFieldClazz$1(NonStaticFieldClazz var1) {
        super(var1);
        this.this$0 = var1;
    }
}

2. 局部变量-匿名内部类的非static实例
class NonStaticFieldClazz$2 extends NonStaticFieldClazz.Inner3 {
    private Integer field_333;
    NonStaticFieldClazz$2(NonStaticFieldClazz var1) {
        super(var1);
        this.this$0 = var1;
    }
}

3. 局部变量和成员变量的非static内部类的非static实例
public class NonStaticFieldClazz$Inner3 {
    public NonStaticFieldClazz$Inner3(NonStaticFieldClazz var1) {
        this.this$0 = var1;
    }
}

参考：

内存泄漏-内部类持有外部类引用


                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/fei-jing-tai-nei-bu-lei-chi-you-wai-bu-lei-de-yin-yong/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/neo4j-chang-yong-ming-ling/">
                        Neo4j 常用命令 一
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-05-08</time>
                    
                        <a href="https://imyzt.top/tag/XM6uOsCyh/" class="post-tag i-tag
                            i-tag-other_2">
            #Neo4j
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            WHERE
可以类似于SQL的写法来实现，首先通过match将节点查询出来(n,m)，然后通过WHERE将数据
match (n:Lianhuachi),(m:Lianhuachi) where n.name = &#39;去种田的向凹凸&#39; and m.name = &amp;quot;向云朵&amp;quot;
return id(n),n.name,id(m),m.name

match (n:Lianhuachi {name: &amp;quot;去种田的向凹凸&amp;quot;}),(m:Lianhuachi {name: &amp;quot;向云朵&amp;quot;})
return id(n),n.name,id(m),m.name

DELETE-删除节点

删除节点（如果节点存在关系时，是无法删除的）

match (n: Person {name: &amp;quot;xxx&amp;quot;}) delete n


删除关系

match (n: Person {name: &amp;quot;小红&amp;quot;})-[r]-&amp;gt;(m: Person {name: &amp;quot;小明&amp;quot;}) delete r

REMOVE-删除属性
首先，在student和person标签创建1一个节点
create (n:student:person {name: &amp;quot;张三&amp;quot;, age: 18}) return n

查询节点
MATCH (n:person) where n.name = &amp;quot;张三&amp;quot; RETURN n LIMIT 25

MATCH (n:student) RETURN n LIMIT 25

删除标签中的节点
MATCH (n:person) where n.name = &amp;quot;张三&amp;quot; remove n
删除标签中节点的属性
删除前，age=18 MATCH (n:student) where n.name = &amp;quot;张三&amp;quot; return n

删除后，age无了 MATCH (n:student) where n.name = &amp;quot;张三&amp;quot; remove n.age return n

修改标签中节点的属性
修改后，age回来了 MATCH (n:student) where n.name = &amp;quot;张三&amp;quot; set n.age=18 return n

给榜首增加一个属性 match (n:Lianhuachi {name: &amp;quot;我是野农&amp;quot;}) set n.title = &#39;虾米榜榜首&#39; return n

ORDER BY - 排序
补充测试数据
create (n:student {name: &amp;quot;张三&amp;quot;, age: 18}),(m:student {name: &amp;quot;李四&amp;quot;, age: 22}) return n,m
排序
match (n:student) return id(n), n.name,n.age order by n.age desc 



id(n)
n.name
n.age




120
&amp;quot;李四&amp;quot;
22


119
&amp;quot;张三&amp;quot;
18



NULL - NULL属性
查询name属性不为空的节点
match (n:student) where n.name is not null return n.name,n.label



n.name
n.label




&amp;quot;张三&amp;quot;
null


&amp;quot;李四&amp;quot;
null



查询sex属性为空的节点
match (n:student) where n.sex is null return n.name,n.label



n.name
n.label




&amp;quot;张三&amp;quot;
null


&amp;quot;李四&amp;quot;
null



给张三设置sex属性，注意where在前，set在后，和MySQL等相反
match (n:student)  where n.name=&#39;张三&#39; set n.sex=&#39;男&#39; return n.name,n.sex,n.age
查询结果：match (n:student) return n

IN - 查询多个
查询name等于张三或李四的人：
match (n:student) where n.name in [&amp;quot;张三&amp;quot;, &amp;quot;李四&amp;quot;] return n
索引
官方文档
旧版本


创建索引：
create index on :节点 (属性)


删除索引：
drop index on :节点(属性)


新版本(5或更高版本)


创建索引：
缺省索引名称：
CREATE INDEX [index_name（可缺省）] FOR (n:person) ON (n.name)
指定索引名称：
create index index_test for (n:person) on (n.name)
Added 1 index, completed after 992 ms.


查询所有索引：
show indexes





id
name
state
populationPercent
type
entityType
labelsOrTypes
properties
indexProvider
owningConstraint
lastRead
readCount




1
&amp;quot;index_343aff4e&amp;quot;
&amp;quot;ONLINE&amp;quot;
100
&amp;quot;LOOKUP&amp;quot;
&amp;quot;NODE&amp;quot;
null
null
&amp;quot;token-lookup-1.0&amp;quot;
null
&amp;quot;2024-05-18T13:26:33.878000000Z&amp;quot;
571


3
&amp;quot;index_a302cc54&amp;quot;
&amp;quot;ONLINE&amp;quot;
100
&amp;quot;RANGE&amp;quot;
&amp;quot;NODE&amp;quot;
[&amp;quot;person&amp;quot;]
[&amp;quot;name&amp;quot;]
&amp;quot;range-1.0&amp;quot;
null
null
0


2
&amp;quot;index_f7700477&amp;quot;
&amp;quot;ONLINE&amp;quot;
100
&amp;quot;LOOKUP&amp;quot;
&amp;quot;RELATIONSHIP&amp;quot;
null
null
&amp;quot;token-lookup-1.0&amp;quot;
null
&amp;quot;2024-05-10T00:48:00.395000000Z&amp;quot;
67




删除索引：
drop index index_a302cc54
Removed 1 index, completed after 5 ms.


                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/neo4j-chang-yong-ming-ling/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/shi-yong-neo4j-jian-li-lian-hua-chi-ren-wu-guan-xi-tu-he-xin-ren-wu-jian-ban/">
                        使用Neo4j建立莲花池人物关系图（核心人物，简版）
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-04-22</time>
                    
                        <a href="https://imyzt.top/tag/XM6uOsCyh/" class="post-tag i-tag
                            i-tag-other_4">
            #Neo4j
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            最近关注了沅陵的莲花池，整个村子都是钓鱼佬，人均up主，基本都是沾亲带故的，错综复杂，恰逢正在学习Neo4j，可以借此机会将人物关系通过图谱的方式呈现出来。
人物标签创建
首先将人物关系建立出来，利用create来创建效率实在太低了 ，所以决定采用数据导入的方式。

点击查看莲花池人物详情

  去种田的向凹凸  
  
    小白兔的胡萝卜甜（冉甜）
  
  
    向云朵
  
  
    我是野农
  
  
    画燕儿
  
  
    向鹿鸣
  
  
    路人阿丙X
  
  
    大明星（冉蜜）
  
  
    向偶然
  
  
    荷塘星星
  
  
    向尘俊
  
  
    向星言
  
  
    多肉葡萄肉多多
  
  
    白叔
  
  
    播音哥
  
  
    三叔
  
  
    丹宝
  
  
    守山人阿亮
  
  

导入数据：
load csv from &amp;quot;file:///莲花池人物.csv&amp;quot; as line 
create (:Lianhuachi {name: line[0]})

最终效果图：
MATCH (n:Lianhuachi) RETURN n LIMIT 25

人物关系标签创建

莲花池人物关系（简版）
  小白兔的胡萝卜甜（冉甜）,丈夫,去种田的向凹凸
  去种田的向凹凸,妻子,小白兔的胡萝卜甜（冉甜）
  小白兔的胡萝卜甜（冉甜）,女儿,向云朵
  去种田的向凹凸,女儿,向云朵
  画燕儿,丈夫,我是野农
  我是野农,妻子,画燕儿
  画燕儿,儿子,向鹿鸣
  我是野农,儿子,向鹿鸣
  大明星（冉蜜）,丈夫,路人阿丙X
  路人阿丙X,妻子,大明星（冉蜜）
  大明星（冉蜜）,女儿,向偶然
  路人阿丙X,女儿,向偶然
  多肉葡萄肉多多,丈夫,荷塘星星
  荷塘星星,妻子,多肉葡萄肉多多
  荷塘星星,儿子,向尘俊
  多肉葡萄肉多多,儿子,向尘俊
  荷塘星星,女儿,向星言
  多肉葡萄肉多多,女儿,向星言
  向星言,亲哥,向尘俊
  向尘俊,亲妹,向星言
  荷塘星星,父亲,三叔
  三叔,儿子,荷塘星星
  荷塘星星,表哥,守山人阿亮
  守山人阿亮,表弟,荷塘星星
  我是野农,亲弟,路人阿丙X
  路人阿丙X,亲哥,我是野农
  我是野农,钓友,去种田的向凹凸
  去种田的向凹凸,钓友,我是野农
  去种田的向凹凸,同村,荷塘星星
  我是野农,钓友,荷塘星星
  荷塘星星,钓友,我是野农
  去种田的向凹凸,同村,荷塘星星

导入数据：
load csv from &amp;quot;file:///莲花池人物关系.csv&amp;quot; as line 
create (n:LianhuachiRelation {from: line[0], relation: line[1], to: line[2]})
return n.from, n.relation, n.to

最终效果：
MATCH (n:LianhuachiRelation) RETURN n.from, n.relation, n.to

借助人物关系标签，创建人物关系
match (f:Lianhuachi),(r:LianhuachiRelation),(t:Lianhuachi) where f.name=r.from and t.name=r.to
create (f)-[rr:莲花池人物关系 {relation: r.relation}]-&amp;gt;(t)
return f.name, rr.relation, t.name

最终效果：
MATCH p=()-[r:莲花池人物关系]-&amp;gt;() RETURN p LIMIT 25

查询人物关系
match (n:Lianhuachi {name: &amp;quot;向云朵&amp;quot;}),(m:LianhuachiRelation) where m.from=&#39;向云朵&#39;
    return n.name, m.relation, m.to


在现有的基础上，补充人物关系
match (n:Lianhuachi{name:&amp;quot;大明星（冉蜜）&amp;quot;}),(m:Lianhuachi{name:&amp;quot;小白兔的胡萝卜甜（冉甜）&amp;quot;})
create (n)-[r:`莲花池人物关系`{relation:&amp;quot;亲姐&amp;quot;}]-&amp;gt;(m)

match (n:Lianhuachi{name:&amp;quot;大明星（冉蜜）&amp;quot;}),(m:Lianhuachi{name:&amp;quot;小白兔的胡萝卜甜（冉甜）&amp;quot;})
create (m)-[r:`莲花池人物关系`{relation:&amp;quot;亲妹&amp;quot;}]-&amp;gt;(n)


删除重建人物关系
MATCH (n:Lianhuachi {name:&amp;quot;去种田的向凹凸&amp;quot;})-[r:`莲花池人物关系` {relation: &amp;quot;钓友&amp;quot;}]-&amp;gt;(m:Lianhuachi {name:&amp;quot;我是野农&amp;quot;})
delete r
MATCH (n:Lianhuachi {name:&amp;quot;我是野农&amp;quot;})-[r:`莲花池人物关系` {relation: &amp;quot;钓友&amp;quot;}]-&amp;gt;(m:Lianhuachi {name:&amp;quot;去种田的向凹凸&amp;quot;})
delete r

MATCH (n:Lianhuachi {name:&amp;quot;去种田的向凹凸&amp;quot;}),(m:Lianhuachi {name:&amp;quot;我是野农&amp;quot;})
create (n)-[r2:`莲花池人物关系` {relation: &amp;quot;表哥&amp;quot;}]-&amp;gt;(m)
create (m)-[r3:`莲花池人物关系` {relation: &amp;quot;表弟&amp;quot;}]-&amp;gt;(n)
 return r2.relation,r3.relation



                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/shi-yong-neo4j-jian-li-lian-hua-chi-ren-wu-guan-xi-tu-he-xin-ren-wu-jian-ban/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/java8-shi-yong-suntoolsjavadoc-du-qu-zhu-shi-xin-xi/">
                        Java8 使用sun.tools.javadoc 读取注释信息
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-04-10</time>
                    
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            前言
项目需要整理所有依赖的外部Feign调用，整理成一份文档，类似于：



远程接口
调用位置
作用




xxx/zzz
top.imyzt.xxx#methodName
用作xxx



方案
因为项目过多，且依赖的外部服务接口众多，不想一个个去整理，故想直接读取所有的Feign接口，直接扫描出方法注释，将上述表格完成。
Java是编译型语言，当代码从.java编译成.class后，代码中的注释将会清空，所以说，项目打包之后，就无法再进行注释的解析了，所以反射等方案不可行，通过在Google搜索，发现了com.sun.tools.javadoc.Main工具类，可以直接读取文件的形式读取.java文件，然后解析其中的各类注释信息，使用起来也很简单，下面举个例子：
/**
 * 类注释
 * @author imyzt
 * @date 2024/04/10
 */
public class Demo {

    /**
     * 方法注释
     */
    public void demo() {

    }
}

上面是一个简单的带注释的类，通过sun公司的工具类，可以直接读取：
public class Doclet {
    public static Logger logger = LoggerFactory.getLogger(Doclet.class);

    private static RootDoc rootDoc;
    private final String clsFilePath;

    public static boolean start(RootDoc root) {
        rootDoc = root;
        return true;
    }

    public Doclet(String clsFilePath) {
        this.clsFilePath = clsFilePath;
    }

    public void exec() {
        com.sun.tools.javadoc.Main.execute(
                new String[]{&amp;quot;-doclet&amp;quot;, Doclet.class.getName(),
                        &amp;quot;-docletpath&amp;quot;, Doclet.class.getResource(&amp;quot;/&amp;quot;).getPath(),
                        &amp;quot;-encoding&amp;quot;, &amp;quot;utf-8&amp;quot;,
                        clsFilePath});
        ClassDoc[] classes = rootDoc.classes();

        if (classes == null || classes.length == 0) {
            logger.warn(clsFilePath + &amp;quot; 无ClassDoc信息&amp;quot;);
            return;
        }

        ClassDoc classDoc = classes[0];
        // 获取类的名称
        System.err.println(&amp;quot;类名：&amp;quot; + classDoc.name());
        // 获取类的注释
        String classComment = Reflect.on(classDoc).field(&amp;quot;documentation&amp;quot;).get().toString();
        System.err.println(&amp;quot;类注释：&amp;quot; + classComment);
        // 获取属性名称和注释
        for (FieldDoc field : classDoc.fields(false)) {
            System.err.printf(&amp;quot;属性名：%s, 属性类型：%s, 注释：%s%n&amp;quot;, field.name(), field.type().typeName(), field.commentText());
        }

        for (MethodDoc method : classDoc.methods(false)) {
            System.err.printf(&amp;quot;方法名：%s, 方法返回类型：%s, 注释：%s%n&amp;quot;, method.name(), method.returnType().typeName(), method.commentText());
        }
    }
}

最终的运行效果：
public class CommentReader {

    public static void main(String[] args) {
        Doclet doclet = new Doclet(&amp;quot;/Users/.../java-reader-classormethod-comment/src/main/java/top/imyzt/learing/readercomment/Demo.java&amp;quot;);
        doclet.exec();
        // 正在构造 Javadoc 信息...
        // 类名：Demo
        // 类注释： 类注释
        //  @author imyzt
        //  @date 2024/04/10
        //
        // 方法名：demo, 方法返回类型：void, 注释：方法注释
    }
}


通过这个工具类，可以快速的读取，解析各类注释信息，进行资料的整理。
工具类还有很多其他的API，网上资料也很多，这里只是记录做一个备忘，具体的使用时进行Google搜索即可。
示例代码
java-reader-classormethod-comment

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/java8-shi-yong-suntoolsjavadoc-du-qu-zhu-shi-xin-xi/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/neo4j-shi-yong/">
                        Neo4j 使用
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-04-07</time>
                    
                        <a href="https://imyzt.top/tag/XM6uOsCyh/" class="post-tag i-tag
                            i-tag-success">
            #Neo4j
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            
图数据模型：与关系型数据库使用表格存储数据不同，图数据库通过节点（Node）和关系（Relationship）来表示数据和它们之间的联系。
节点：代表实体，如人、地点、物品等。
关系：定义节点之间的连接，可以有方向和属性。
属性：节点和关系的附加信息，如人的姓名、年龄等。

CREATE (person1:Person {name: &#39;Alice&#39;, age: 30})
CREATE (person2:Person {name: &#39;Bob&#39;, age: 25})
CREATE (person1)-[:KNOWS]-&amp;gt;(person2)


person1/person2：节点
Person：标签
name/age：属性
KNOWS：关系

导入数据
通过GPT，生成《西游记》的人物关系图和人物名单，案例数据如下：

将文件放置于Neo4j的Home/import目录下，然后执行导入命令：
load csv from &amp;quot;file:///西游记.csv&amp;quot; as line
create (:xiyouRelation {from:line[1], relation:line[3],to:line[0]})

load csv from &amp;quot;file:///人物.csv&amp;quot; as line
create (:person {name:line[0]})

执行match (person) return person，查看数据：

创建人物和关系
创建人物和关系
创建人物
create (:student {name: &#39;小明&#39;}),(:student {name : &#39;小红&#39;}),(:student {name: &#39;小李&#39;})
创建人物关系，并且返回人物关系
match (n:student {name: &#39;小明&#39;}),(m:student {name: &#39;小红&#39;})
create (n)-[r:同学]-&amp;gt;(m) return n.name,type(r),m.name


显示人物关系
MATCH p=()-[r:`同学`]-&amp;gt;() RETURN p LIMIT 25


删除标签
match (n:LianhuachiPerson)
detach delete n


删除关系
命令：
match (n)-[r:西游人物关系]-(s) delete r
结果：
Deleted 18 relationships, completed after 6 ms.

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/neo4j-shi-yong/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/hua-shi/">
                        花市
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-03-26</time>
                    
                        <a href="https://imyzt.top/tag/U4HAFHPoI/" class="post-tag i-tag
                            i-tag-other_2">
            #生活记录
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            

-- 2024-03-24 摄于荷兰花卉小镇

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/hua-shi/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/ye-wu-luo-ji-bian-pai-cuo-wu-and-ttl-qian-kao-bei-dao-zhi-can-shu-diu-shi-wen-ti/">
                        业务逻辑编排错误 &amp; TTL浅拷贝导致参数丢失问题
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-03-09</time>
                    
                        <a href="https://imyzt.top/tag/_KxCNznKV/" class="post-tag i-tag
                            i-tag-other_1">
            #ThreadLocal
        </a>
                        
                        <a href="https://imyzt.top/tag/sob7n9Mdo/" class="post-tag i-tag
                            i-tag-banana">
            #线程池
        </a>
                        
                        <a href="https://imyzt.top/tag/KjxmDkyMU/" class="post-tag i-tag
                            i-tag-other_3">
            #问题解决
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            前言
在DDD项目中，为了方便参数的传递，通常会使用ThreadLocal来保存一个对象来实现对参数的跨方法传递，避免通过形参的形式传递。在内部项目中，有一个项目使用的是 alibaba开源的 transmittable-thread-local来存储参数，新建了一个上下文对象（AbilityContext.java），使用HashMap来临时存储和获取参数。

AbilityContext 示例
public class AbilityContext {
    private static final ThreadLocal&amp;lt;Map&amp;lt;String, Object&amp;gt;&amp;gt; CONTEXT = new TransmittableThreadLocal&amp;lt;&amp;gt;();

    private AbilityContext() {
    }

    /**
     * 初始化上下文
     */
    public static void initContext() {
        Map&amp;lt;String, Object&amp;gt; con = CONTEXT.get();
        if (con == null) {
            CONTEXT.set(new HashMap&amp;lt;&amp;gt;(8));
        } else {
            CONTEXT.get().clear();
        }
    }

    /**
     * 清除上下文
     */
    public static void clearContext() {
        CONTEXT.remove();
    }

    public static Map&amp;lt;String, Object&amp;gt; getInnerMap() {
        return CONTEXT.get();
    }

    /**
     * 获取上下文内容
     */
    public static &amp;lt;T&amp;gt; T getValue(String key) {
        Map&amp;lt;String, Object&amp;gt; con = CONTEXT.get();
        if (con == null) {
            return null;
        }
        return (T) con.get(key);
    }

    /**
     * 设置上下文参数
     */
    public static void putValue(String key, Object value) {
        Map&amp;lt;String, Object&amp;gt; con = CONTEXT.get();
        if (con == null) {
            CONTEXT.set(new HashMap&amp;lt;&amp;gt;(8));
            con = CONTEXT.get();
        }
        con.put(key, value);
    }
}


项目情况介绍
通常来说，DDD项目的基本流程是由interface-&amp;gt;application，中间封装一层来集中处理上下文的初始化和清空动作，如下图：

在正常情况下，上述流程可以正确的完成参数的写入和获取，但是，在项目运行过程中遇到了一个bug，正常写入参数后，偶现性（低频）获取值为NULL，导致程序出错，示例代码如下（隐去业务代码，重新写的伪代码）：

其中demo()方法为当时复现的方法
demo2()为伪代码，是业务代码中调用了另一个application，假设其逻辑和demo()方法一致的业务代码。

@Slf4j
public class AlibabaTtlWrongUsageExampleApplication {

    public static void main(String[] args) {
        demo(i);
    }

    private static void demo(int idx) {
        // 初始化
        AbilityContext.initContext();
        // 赋业务值
        AbilityContext.putValue(&amp;quot;main&amp;quot;, &amp;quot;mainValue&amp;quot;);

        // 这里简化了代码，实际上经过了很多层业务代码调用后才出现了此方法
        ThreadUtil.execute(() -&amp;gt; {
            execute-&amp;gt;demo2();
        });

        // do something

        // 主线程再次获取业务值(偶现为null)
        String value = AbilityContext.getValue(&amp;quot;main&amp;quot;);
        if (Objects.isNull(value)) {
            log.warn(&amp;quot;lastGetNullValue, idx={}&amp;quot;, idx);
        }
    }
}

上述代码运行设置了一个key=main，值为mainValue。在下方AbilityContext.getValue(&amp;quot;main&amp;quot;)偶现获取==NULL。
展开分析
当时在分析的开始有推测是业务代码中参数被重新赋值为NULL，但通过对后续业务代码逐行查看，并没有找到重新赋值的逻辑。
在深入业务代码分析的过程中，发现主流程中有一个异步方法调用（ThreadUtil.execute()），再次调用了另一个领域服务（这是不符合DDD规范的！），而领域服务的入口都会AbilityContext.initContext()的逻辑，通过这个线索 ，继续展开了深入分析。

编码者的初衷可能是想到异步线程已经脱离了当前线程，再次调用 initContext()方法是初始化了一个新的对象上下文，但是由于项目使用的是 alibaba TTL，能够实现跨线程的传递，所以在子线程中依旧能拿到父线程的HashMap。并且TTL默认是使用的浅拷贝对象。由于initContext()中，调用了HashMap.clear()方法，相当于将父线程的HashMap给清空了！。
通过比对父子线程的hashCode值确定为同一对象
// 主线程获取hashCode
final int hashCode = AbilityContext.getInnerMap().hashCode();
ThreadUtil.execute(() -&amp;gt; {
    // 子线程对比hashCode
    log.info(&amp;quot;{}, ThreadUtil hashCode={}&amp;quot;, idx, AbilityContext.getInnerMap().hashCode() == hashCode);
    // 子线程再次初始化(错误的根源)
    AbilityContext.initContext();
    // do something
});
14:42:28.198 [pool-1-thread-26] INFO top.imyzt.learning.caseanalysis.ttl.AlibabaTtlWrongUsageExampleApplication -- 25, ThreadUtil hashCode=true

持续分析
有了上述的线索，基本把问题原因找到了，但是为什么是偶现的呢？
因为使用了异步线程，而线程的调度由操作系统的线程调度算法来决定，并不是一定保证顺序的，所以只要当操作系统优先调度异步线程，那么HashMap就被清空了，如果主线程优先往下走，那么就能够获取到完整的HashMap。
后记
至此，问题分析就告一段落了，整个过程中涉及到 TTL值的父子线程传递、对象浅拷贝、线程的调度，还涉及到了DDD的不规范逻辑编排，整个分析下来花费了一上午的时间，收获还是很大的。

transmittable-thread-local
TransmittableThreadLocal的传递只有浅拷贝吗？
线程的优先级

我将源代码上传了GitHub，如果你想在本地调试运行上述案例，可以下载到本地调试，有问题可以评论区沟通。

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/ye-wu-luo-ji-bian-pai-cuo-wu-and-ttl-qian-kao-bei-dao-zhi-can-shu-diu-shi-wen-ti/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/shi-yong-redis-shi-xian-fen-bu-shi-suo-de-keng/">
                        使用Redis实现分布式锁的坑
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-03-04</time>
                    
                        <a href="https://imyzt.top/tag/cZVWiX7Fs/" class="post-tag i-tag
                            i-tag-other_1">
            #Redis
        </a>
                        
                        <a href="https://imyzt.top/tag/pOZSPM4n_2/" class="post-tag i-tag
                            i-tag-other_3">
            #分布式锁
        </a>
                        
                        <a href="https://imyzt.top/tag/KjxmDkyMU/" class="post-tag i-tag
                            i-tag-error">
            #问题解决
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            分布式锁的关键在于对单一资源的竞争。获得资源的实例将继续执行，其余实例要么退出（互斥锁），要么等待（阻塞锁）。
实现分布式锁的方案有很多，既可以直接使用MySQL作为分布式锁（例如xxl-job），也可以利用ZooKeeper、Redis等。
在基于Spring Cloud的业务系统中，一般都会引入Redis作为分布式缓存中间件，因此更多的人会选择使用Redis来实现分布式锁。本文将介绍使用Redis作为分布式锁时常见的问题和解决方法。
1. 没有使用原子操作指令
错误写法
    Boolean tryLock = stringRedisTemplate.opsForValue().setIfAbsent(lockKey, lockValue);
    stringRedisTemplate.expire(lockKey, Duration.ofSeconds(expireTime));
    if (!tryLock) {
        return;
    }

上述操作通常出现在新手阶段，在写入锁对象时，没有考虑到原子性问题。在Redis中有提供SET NX PX指令，支持在设置锁的同时指定过期时间，并且支持原子性判断key是否已存在。
NX 和 PX 是 Redis 命令中用于设置 key 的两个选项。

NX: 当指定 NX 选项时，只有在 key 不存在的情况下才会设置 key 的值。如果 key 已经存在，则不进行任何操作。
PX: PX 选项用于设置 key 的过期时间（以毫秒为单位）。例如，PX 10000 表示在 10 秒后将 key 设置为过期状态。

正确写法：
Boolean tryLock = stringRedisTemplate.opsForValue().setIfAbsent(lockKey, lockValue, expireTime, TimeUnit.MILLISECONDS);

2. 释放了别人的锁
错误写法
try {
    Boolean tryLock = stringRedisTemplate.opsForValue().setIfAbsent(lockKey, lockValue, expireTime, TimeUnit.MILLISECONDS);
    if (!tryLock) {
        return;
    }

    // do something
    } finally {
    stringRedisTemplate.delete(lockKey);
    }

在加锁的过程中，没有设定唯一值作为Value存储到Redis中，在释放时，不判断直接对锁进行释放。其二，将获取锁的代码放在了try代码块中。
在上述代码中存在两个问题：

不该执行到finlly代码块：A请求获得了锁正在执行业务代码，而B请求没有获得锁，但是因为获取锁的代码在try代码块中，导致finally一定会执行，B请求就会将A请求的锁释放，而如果A请求依旧未执行完毕，此时C请求过来时，则C请求错误的拿到了锁。
不该删除别人的锁：在删除锁时，应该判断自己是否是上锁人，由于多次执行Redis指令不具备原子性，所以一般是交由LUA脚本来实现的。

if redis.call(&#39;get&#39;, KEYS[1]) == ARGV[1]
    then
        return redis.call(&#39;del&#39;, KEYS[1])
    else
        return 0
end

正确写法

提前将LUA脚本载入到Redis服务端

script = new DefaultRedisScript&amp;lt;&amp;gt;();
script.setResultType(Long.class);
script.setScriptSource(new ResourceScriptSource(new ClassPathResource(&amp;quot;release_lock.lua&amp;quot;)));


获取和释放锁示例

Boolean tryLock = stringRedisTemplate.opsForValue().setIfAbsent(lockKey, lockValue, expireTime, TimeUnit.MILLISECONDS);
if (!tryLock) {
    return;
}
try {

    // do something
} finally {
    ArrayList&amp;lt;String&amp;gt; keys = new ArrayList&amp;lt;&amp;gt;();
    keys.add(context.getLockKey());
    stringRedisTemplate.execute(this.script, keys, context.getLockValue());
}

3. 事务未提交锁就释放了
错误代码
/**
    * 事务内获取分布式锁
    */
@Transactional(rollbackFor = Exception.class)
public void saveUserWithDistributedLock(String name) {

    String lockKey = &amp;quot;lock_key:&amp;quot; + name;
    RedisLock.LockContext lockContext = redisLock.tryLock(lockKey, 10000L);
    if (!lockContext.getTryLock()) {
        // printLog(&amp;quot;没拿到锁&amp;quot;);
        return;
    }

    printLog(&amp;quot;拿到锁了&amp;quot; + lockKey);

    try {
        this.save(name);
    } finally {
        redisLock.release(lockContext);
        printLog(&amp;quot;释放锁了&amp;quot;);
    }
}

MySQL常规情况下是RR的隔离级别，只有等到事务提交数据才对其他事务可见，存在**“读视图”，在上述的代码中，A请求拿到了锁执行了业务代码，执行到redisLock.release时将锁释放了，但Spring的@Transactional依赖的是AOP，其需要等到方法执行完毕才会提交事务，在这个临界点，B请求可以正常拿到锁，但是A请求的事务还未提交，B请求的读视图**中还未查询到A请求提交的数据，最终造成了数据的不一致性。
正确代码
正确的情况是在另一个方法中获取到锁之后，再调用包含事务的业务代码。此时需要注意SpringAOP在本方法内代理失效的问题，通常需要新建一个Service来处理。
业务代码执行超过锁过期时间
错误代码
// Domain-Service
public void save(String name) {

    String lockKey = &amp;quot;lock_key:&amp;quot; + name;
    RedisLock.LockContext lockContext = redisLock.tryLock(lockKey, 10000L);
    if (!lockContext.getTryLock()) {
        printLog(&amp;quot;没拿到锁&amp;quot;);
        return;
    }

    printLog(&amp;quot;拿到锁了&amp;quot; + lockKey);
    try {
        userService.save(name);
    } finally {
        redisLock.release(lockContext);
        printLog(&amp;quot;释放锁了&amp;quot;);
    }
}

// UserService
@Transactional(rollbackFor = Exception.class)
public void save(String name) {

    List&amp;lt;User&amp;gt; users = userRepository.findUsersByName(name);
    if (CollUtil.isNotEmpty(users)) {
        printLog(&amp;quot;已经写入, 不再写入&amp;quot; + users);
        return;
    }

    // 业务保存模拟执行很慢
    TimeUnit.SECONDS.sleep(70);
    
}

上述代码中，锁对象只有10s的时间，但是业务代码执行却需要70s，A请求虽然拿到了锁，此时后续10秒其他请求均无法获取锁，但是从第11秒开始的请求将可以拿到锁，而此时A请求还未执行完毕，此时开始出现错误的获取锁，最终造成数据的不一致。
正确写法
参考Redisson的WatchDog机制，另外开辟线程每隔 10s 就给还未执行完毕的 Key 自动续期 30s，保证业务代码能够安全的执行完毕再自行释放锁对象。
示例代码：
// watch dog
Executors.newScheduledThreadPool(1).scheduleAtFixedRate(() -&amp;gt; {
    if (!LOCK_CONTEXTS.isEmpty()) {
        for (LockContext lockContext : LOCK_CONTEXTS) {
            // 如果执行线程还未释放锁, 续期30s(模拟Redisson)
            stringRedisTemplate.expire(lockContext.getLockKey(), Duration.ofSeconds(30));
            Long expire = stringRedisTemplate.getExpire(lockContext.getLockKey());
            log.info(&amp;quot;WatchDog, expire 30s, lockKey={}, ttl={}&amp;quot;, lockContext.getLockKey(), expire);
        }
    }
        }, 0,
        // 10秒检测一次
        10, TimeUnit.SECONDS);

后记
分布式锁的错误还有很多，本篇主要是自己在工作过程中遇到的一些坑，着重介绍新手阶段在编写分布式锁时遇到的比较基础的问题，后面有空再进行其他场景的逐个介绍。
本文参考：聊聊redis分布式锁的8大坑
本文代码：redis-lua-distributed-lock

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/shi-yong-redis-shi-xian-fen-bu-shi-suo-de-keng/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/cuo-yong-hashedwheeltimer-dao-zhi-de-oom-wen-ti/">
                        错用HashedWheelTimer导致的OOM问题
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-02-04</time>
                    
                        <a href="https://imyzt.top/tag/CbzZOlvAr/" class="post-tag i-tag
                            i-tag-other_3">
            #RabbitMQ
        </a>
                        
                        <a href="https://imyzt.top/tag/KjxmDkyMU/" class="post-tag i-tag
                            i-tag-other_2">
            #问题解决
        </a>
                        
                        <a href="https://imyzt.top/tag/i73r1WX7G/" class="post-tag i-tag
                            i-tag-">
            #TimeingWheel
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            事件中心在私有化环境下，只要server一启动过几秒就oom，查看日志是 Failed to create a thread: retVal -1073741830, errno 11。
异常堆栈：
Caused by: java.lang.OutOfMemoryError: Failed to create a thread: retVal -1073741830, errno 11   
    at java.lang.Thread.startImpl(Native Method) 
    at java.lang.Thread.start(Thread.java:993) 
    at io.netty.util.HashedWheelTimer.start(HashedWheelTimer.java:366) 
    at io.netty.util.HashedWheelTimer.newTimeout(HashedWheelTimer.java:447) 
    at 业务调用代码省略

在标品环境下没有问题，在其他KA客户上也没有问题
通过对日志的分析，最终发现是事件中心的延迟消息代码存在缺陷，使用了Netty的HashedWheelTimer，但是语法存在问题，理论上应该是new一个HashedWheelTimer来处理所有时间延迟，但是错用程每次new一个新的HashedWheelTimer，HashedWheelTimer内部每次都会new一个新的线程来处理做调度，一个线程占用1MB，最终内存资源被耗尽。
io.netty.util.HashedWheelTimer#HashedWheelTimer源码：
public HashedWheelTimer(
    ThreadFactory threadFactory,
    long tickDuration, TimeUnit unit, int ticksPerWheel, boolean leakDetection,
    long maxPendingTimeouts, Executor taskExecutor) {

    checkNotNull(threadFactory, &amp;quot;threadFactory&amp;quot;);
    checkNotNull(unit, &amp;quot;unit&amp;quot;);
    checkPositive(tickDuration, &amp;quot;tickDuration&amp;quot;);
    checkPositive(ticksPerWheel, &amp;quot;ticksPerWheel&amp;quot;);
    this.taskExecutor = checkNotNull(taskExecutor, &amp;quot;taskExecutor&amp;quot;);

    // Normalize ticksPerWheel to power of two and initialize the wheel.
    wheel = createWheel(ticksPerWheel);
    mask = wheel.length - 1;

    // Convert tickDuration to nanos.
    long duration = unit.toNanos(tickDuration);

    // Prevent overflow.
    if (duration &amp;gt;= Long.MAX_VALUE / wheel.length) {
        throw new IllegalArgumentException(String.format(
                &amp;quot;tickDuration: %d (expected: 0 &amp;lt; tickDuration in nanos &amp;lt; %d&amp;quot;,
                tickDuration, Long.MAX_VALUE / wheel.length));
    }

    if (duration &amp;lt; MILLISECOND_NANOS) {
        logger.warn(&amp;quot;Configured tickDuration {} smaller then {}, using 1ms.&amp;quot;,
                    tickDuration, MILLISECOND_NANOS);
        this.tickDuration = MILLISECOND_NANOS;
    } else {
        this.tickDuration = duration;
    }

    // 每次都new一个线程来处理
    workerThread = threadFactory.newThread(worker);

    leak = leakDetection || !workerThread.isDaemon() ? leakDetector.track(this) : null;

    this.maxPendingTimeouts = maxPendingTimeouts;

    if (INSTANCE_COUNTER.incrementAndGet() &amp;gt; INSTANCE_COUNT_LIMIT &amp;amp;&amp;amp;
        WARNED_TOO_MANY_INSTANCES.compareAndSet(false, true)) {
        reportTooManyInstances();
    }
}

因为标品和其他KA使用的是阿里云RocketMQ，此客户使用的是自建的开源版RocketMQ，开源RocketMQ是没有自定义时长的延迟消息的，所以我们自己实现了一套时间轮来实现任意时长的延迟消息，当小于60s的延迟消息会丢入我们的时间轮来处理延迟投递，当时此客户的环境中有大量的60s内的延迟消息，导致一启动就会崩溃。
不过在RocketMQ5.0也支持任意时长了。

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/cuo-yong-hashedwheeltimer-dao-zhi-de-oom-wen-ti/">Read More ~</a>
                            </div>
                </div>
            </article>
            
            <article class="post i-card">
                <h2 class="post-title">
                    <a href="https://imyzt.top/post/circuitbreak-dao-zhi-threadlocal-can-shu-diu-shi-wen-ti/">
                        CircuitBreak导致ThreadLocal参数丢失问题
                    </a>
                </h2>
                <div class="post-info">
                    <time class="post-time">2024-01-25</time>
                    
                        <a href="https://imyzt.top/tag/_KxCNznKV/" class="post-tag i-tag
                            i-tag-other_3">
            #ThreadLocal
        </a>
                        
                        <a href="https://imyzt.top/tag/KjxmDkyMU/" class="post-tag i-tag
                            i-tag-banana">
            #问题解决
        </a>
                        
                        <a href="https://imyzt.top/tag/r_PTn6Nd-/" class="post-tag i-tag
                            i-tag-other_1">
            #Spring
        </a>
                        
                </div>
                <div class="post-article">
                    
                            <div class="post-content">
                                
                                        <div class="post-content-content">
                                            背景
使用OpenFeign时，通常会实现RequestInterceptor接口来自定义FeignConfiguration，OpenFeign暴露了feign.RequestTemplate信息，给到我们在发送请求前自定义参数信息的扩展点。
在分布式系统中，通常会将本服务的信息（UserInfo、RequestId）透传至下游服务，从而实现分布式链路追踪等功能，对于像用户信息等，在Web系统中通常使用 ThreadLocal 来存储信息，在自定义的FeignConfiguration中获取ThreadLocal再塞入到feign.RequestTemplate中，实现向下游服务的传递，示例：
public class FeignConfiguration implements RequestInterceptor {
    @Override
    public void apply(RequestTemplate template) {
        ServletRequestAttributes attributes = (ServletRequestAttributes) RequestContextHolder.getRequestAttributes();
        String userId = SubjectContext.get().getUserId();
        if (null != attributes) {
            HttpServletRequest request = attributes.getRequest();
            template.header(&amp;quot;token&amp;quot;, request.getHeader(&amp;quot;TOKEN&amp;quot;));
            template.header(&amp;quot;userId&amp;quot;, userId);
        }
    }
}

简单的Context示例：
public class SubjectContext {
    protected static ThreadLocal&amp;lt;UserInfo&amp;gt; subjectContext = new ThreadLocal();
    public static void remove() {
        subjectContext.remove();
    }
    public static void set(UserInfo uerInfo) {
        subjectContext.set(uerInfo);
    }
    public static UserInfo get() {
        return (UserInfo)subjectContext.get();
    }
}

出现错误
上述代码在常规情况下，是能够按照预期执行的。
但是最近项目引入了CircuitBreaker作为服务熔断的断路器之后，上述代码在执行到SubjectContext.get()时，会抛出空指针，拿不到用户信息。
通过分析CircuitBreaker的源码，最终定位到代码出现在Resilience4JCircuitBreaker内部，在Resilience4JCircuitBreaker中有一个public &amp;lt;T&amp;gt; T run(Supplier&amp;lt;T&amp;gt; toRun, Function&amp;lt;Throwable, T&amp;gt; fallback)方法，方法入参的toRun就是封装过的我们定义的Feign接口，其包装过程在FeignCircuitBreakerInvocationHandler#asSupplier代码中，如下：
private Supplier&amp;lt;Object&amp;gt; asSupplier(final Method method, final Object[] args) {
    final RequestAttributes requestAttributes = RequestContextHolder.getRequestAttributes();
    return () -&amp;gt; {
        try {
            RequestContextHolder.setRequestAttributes(requestAttributes);
            // 执行我们的真正方法
            return dispatch.get(method).invoke(args);
        }
        catch (RuntimeException throwable) {
            throw throwable;
        }
        catch (Throwable throwable) {
            throw new RuntimeException(throwable);
        }
    };
}

Spring Cloud CircuitBreaker Resilience4j 提供了两种实现：

使用 Semaphores 的 SemaphoreBulkhead。
一个 FixedThreadPoolBulkhead，它使用一个有界队列和一个固定的线程池。

默认情况下，Spring Cloud CircuitBreaker Resilience4j 使用 FixedThreadPoolBulkhead。要修改默认行为以使用 SemaphoreBulkhead，请将属性 spring.cloud.circuitbreaker.resilience4j.enableSemaphoreDefaultBulkhead 设为 true。
正是由于上述原因，默认将我们的FeignConfiguration提交给了线程池，由于我们使用的是ThreadLocal导致线程本地变量没有向子线程传递，在执行FeignConfiguration时子线程无法拿到Context信息，最终导致程序的报错。
解决办法
通过分析源码我们发现，执行任务的线程池Resilience4JCircuitBreaker#executorService是由外部传递过来进行初始化的，调用方在Resilience4JCircuitBreakerFactory#create(java.lang.String, java.lang.String, java.util.concurrent.ExecutorService)
在Resilience4JCircuitBreakerFactory中发现，是由本实例在create方法被调用时传入的本类的成员变量，即：

private ExecutorService executorService = Executors.newCachedThreadPool();
private ConcurrentHashMap&amp;lt;String, ExecutorService&amp;gt; executorServices = new ConcurrentHashMap&amp;lt;&amp;gt;();


而我们在没有定义自定义Feign Group时，默认使用的就是executorService，在本类中有一个Resilience4JCircuitBreakerFactory#configureExecutorService方法专门保留了外部传入自定义线程池的扩展，我们可以自己实现创建一个支持传递Context到子线程的线程池，即可将参数向下传递，比如像这样：
@Configurable
@AllArgsConstructor
public class CircuitBreakerConfiguration implements ApplicationRunner {

    private final Resilience4JCircuitBreakerFactory factory;
    
    @Override
    public void run(ApplicationArguments args) throws Exception {

        ContextThreadPoolExecutor contextThreadPoolExecutor = 
                new ContextThreadPoolExecutor(2, 5, 1, TimeUnit.MINUTES, new ArrayBlockingQueue&amp;lt;&amp;gt;(1024));

        // **change ThreadPoolExecutor**
        factory.configureExecutorService(contextThreadPoolExecutor);
    }
    
    public static class ContextThreadPoolExecutor extends ThreadPoolExecutor {

        public ContextThreadPoolExecutor(int corePoolSize, int maximumPoolSize, long keepAliveTime, TimeUnit unit, BlockingQueue&amp;lt;Runnable&amp;gt; workQueue) {
            super(corePoolSize, maximumPoolSize, keepAliveTime, unit, workQueue);
        }

        public void execute(Runnable command) {
            super.execute(wrap(command));
        }

        private static Runnable wrap(Runnable runnable) {
            **SubjectContext context = SubjectContext.getContext();**
            return () -&amp;gt; {
                // 将参数向下传递
                **SubjectContext.setContext(context);**
                try {
                    runnable.run();
                } finally {
                    **SubjectContext.clear();**
                }
            };
        }
    }
}

后记
上述的方案只解决了没有自定义Group的情况，官方在自定义Group的情况下是没有保留扩展位的，所以给官方提了一个MR并且已成功合并到主分支，如下：
Customizable groupExecutorService #180

                                        </div>
                                        
                                            <a class="btn btn-text" href="https://imyzt.top/post/circuitbreak-dao-zhi-threadlocal-can-shu-diu-shi-wen-ti/">Read More ~</a>
                            </div>
                </div>
            </article>
            
                <!-- 翻页 -->
                
    <div class="pagination-container">
        
            <a href="https://imyzt.top/" class="page-btn btn">上一页</a>
            
                
                    <a href="https://imyzt.top/page/3/" class="page-btn btn">下一页</a>
                    
    </div>
    
                </div>
                <!--  -->
                <div class="main-container-middle"></div>
                <!--  -->
                <div id="sidebar" class="main-container-right">

                    <!-- 个人信息 -->
                    
    <div class="id_card i-card">
        <div class="id_card-avatar" style="background-image: url(https://imyzt.top/images/avatar.png?v=1722764497330)">
        </div>
        <h1 class="id_card-title">
            杨镇涛的一亩三分地
        </h1>
        <h2 class="id_card-description">
            分享我的技术和生活
        </h2>
        <!--  -->
        <div class="id_card-sns">
            <!-- github -->
            
                <a href="https://github.com/imyzt" target="_blank" rel="noopener noreferrer"><i
                class="fa fa-github"></i></a>
                
                    <!-- twitter -->
                    
                            <!-- weibo -->
                            
                                    <!-- facebook -->
                                    

        </div>
    </div>
    

                        <!-- 公告栏 -->
                        
    <div class="notice-card i-card ">
        <div class="notice-title i-card-title">公告</div>
        <div class="notice-content">
            <a href="https://github.com/imyzt" color="red" target="_blank" >Follow me on GitHub</a>
        </div>
    </div>
    

                </div>
            </div>



            <div class="site-footer">
  Powered by <a href="https://github.com/imyzt" target="_blank">Gridea</a> | 
  <a class="rss" href="https://imyzt.top/atom.xml" target="_blank">RSS</a>
</div>

<script>
  hljs.initHighlightingOnLoad()
</script>

    </div>
    <script>
        $('#sidebar').stickySidebar({
            topSpacing: 80,
            // bottomSpacing: 60
        });
    </script>
</body>

</html>